/*
 * =====================================================================================
 *
 *       Filename:  1+2.c
 *
 *    Description:  我想用一个更直观的名字来命名文件，文件1+2.c比add.c更直观，更多的表达
 *    了程序的目的。
 *
 *        Version:  1.0
 *        Created:  2014年05月03日 23时06分18秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  何伟伟 (), 1830973318@qq.com
 *   Organization:  
 *
 * =====================================================================================
 */


#include<stdio.h>
#include<math.h>
int
main (void)
{
//我想以后我的程序在屏幕上输出更多的汉字！
  //printf ("这是计算机计算出来的1+2的结果： ");
  printf ("程序1-1: 计算并输出1+2的值：");
  printf ("%d\n", 1 + 2);

  printf ("实验一：输出3-4的结果： ");
  printf ("%d\n", 3 - 4);
  printf ("实验二：输出5x6的结果： ");
  printf ("%d\n", 5 * 6);
  printf ("实验三：输出8/4的结果： ");
  printf ("%d\n", 8 / 4);
  printf ("实验四：输出8/5的结果： ");
  printf ("%d\n", 8 / 5);

  printf ("把作者提出的每一个结论都验证一下，\
这里我要验证-8/5的结果是 -1： ");
  printf ("%d\n", (-8) / 5);

  printf ("程序1-2: 计算并输出8/5的值,保留小数点后1位：");
  printf ("%.1lf\n", 8.0 / 5.0);
  //我想看看用%.1f的结果，另外我想知道为什么首选%lf,而不是%f
  //要输出%，要用%%，而不是\%
  printf ("程序1-2: 计算并输出8/5的值,保留小数点后1位(%%f版本)：");
  printf ("%.1f\n", 8.0 / 5.0);

  printf ("程序1-2: 计算并输出8/5的值(%%lf版本)：\n");
  printf ("%lf\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%1lf版本)：\n");
  printf ("%1lf\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%2lf版本)：\n");
  printf ("%2lf\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%10lf版本)：\n");
  printf ("%10lf\n", 8.0 / 5.0);
  //所以10表明的是为这个输出数留出的输出空间。
  printf ("程序1-2: 计算并输出8/5的值(%%.2lf版本)：\n");
  printf ("%.2lf\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%2.2lf版本)：\n");
  printf ("%2.2lf\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%10.2lf版本)：\n");
  printf ("%10.2lf\n", 8.0 / 5.0);
  //所以.2表明的是一个实数在输出时，要显示小数点后几位！

  printf("同样我想看看%%f下的相同情况！\n");
  printf ("程序1-2: 计算并输出8/5的值(%%f版本)：\n");
  printf ("%f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%1f版本)：\n");
  printf ("%1f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%2f版本)：\n");
  printf ("%2f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%10f版本)：\n");
  printf ("%10f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%.2f版本)：\n");
  printf ("%.2f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%2.2f版本)：\n");
  printf ("%2.2f\n", 8.0 / 5.0);
  printf ("程序1-2: 计算并输出8/5的值(%%10.2f版本)：\n");
  printf ("%10.2f\n", 8.0 / 5.0);
  //比较的结果是%f的输出与%lf的输出没有多大的差别！

  //printf ("%.1lf\n", 8/5);//%lf需要double,可是8/5给的是int。
  //printf ("%d\n", 8.0/5.0);//%d需要int，可是8.0/5.0给点是double。
  //有一个简单知道5-0.1的只是整数还是浮点数的办法，就是用%lf和%d来
  //输出5-0.1看哪个会报错！
  printf ("计算并输出5-0.1的值(%%lf版本)：\n");
  printf("%lf\n",5-0.1);
  printf ("计算并输出5-0.1的值(%%d版本)：\n");
  //printf("%d\n",5-0.1);//%d期待int，但是5-0.1的数据类型是double。

  printf("%.8lf\n",1+2*sqrt(3)/(5-0.1));
  printf("%.8lf\n",sqrt(9.0));
  return 0;
}
