/*
 * =====================================================================================
 *
 *       Filename:  helloctags.c
 *
 *    Description:  我用这个程序测试一下ctags如何使用
 *
 *        Version:  1.0
 *        Created:  2014年04月20日 09时01分08秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  何伟伟 (), 1830973318@qq.com
 *   Organization:  
 *
 * =====================================================================================
 */


#include	<stdlib.h>

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  main
 *  Description:  
 * =====================================================================================
 */
	int
main ( int argc, char *argv[] )
{

	return EXIT_SUCCESS;
}				/* ----------  end of function main  ---------- */

